{
    "PRB13": {
        "title": "Sampath's Struggles!",
        "type": "Beginner",
        "state": "up",
        "blurb": "Sampath was struggling in AP Statistics...",
        "description": "Lately, Sampath has not been enjoying himself in AP Statistics. All the long paragraph style problems simply became too much for him, and thus he decided to go back to solving problems from his glory days, namely Algebra 2. Sampath attempted a problem regarding the multiplication of matrices, but was so frustrated with inability to solve it that he coded a program to help him multiple SQUARE matrices.",
        "inputForm": "1st line: N or Dimension of squared matrices<br>The following 2N lines are the square matrices.",
        "sampleInput": "3<br>1 2 3<br>4 5 6<br>7 8 9<br>2 3 4<br>5 6 7<br>8 9 1",
        "outputForm": "A matrix representing the product of the two square matrices.",
        "sampleOutput": "36 42 21<br>81 96 57<br>126 150 93"
    },
    "PRA12": {
        "title": "Sampath Eats Candy!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Yesterday was Sampath's birthday...",
        "description": "Our wonderful workshop director Aditya Sampath turned 18 (or 12, I'm not really sure) yesterday! Since so many people wished him, he decided to buy candy for all his \"K\" friends. Soon Sampath found a candy store and decided to buy some of his favorite candies for his friends. The store offers N packs of these candies, where pack i contains Ai candies.<br>Another reason Sampath decided to buy candies is he likes smelling the wrappers once he is done eating them. That's why he decided to buy exactly M packs and present the friends with the candies and keep the packs for his collection. Sampath would also like the total number of candies to be divisible by K so that an equal distribution of candies between friends is possible. Among all possible sets of packs, Sampath would like to buy a set with the smallest possible total number of candies (since he is cheap).",
        "inputForm": "Each test case consists of two lines. The first of them contains three integers N, M and K. The second of them contains N integers Ai.",
        "sampleInput": "SAMPLE INPUT #1<br>5 3 5<br>1 2 3 4 5<br><br>SAMPLE INPUT #2<br>6 3 4<br>9 5 1 7 3 7",
        "outputForm": "For each test case, output just one line containing the smallest possible total number of bought candies, or -1 if it's impossible to buy exactly M packs so that the total number of candies is divisible by K.",
        "sampleOutput": "SAMPLE OUTPUT #1<br>10<br><br>SAMPLE OUTPUT #2<br>-1"
    },
    "HPI6": {
        "title": "Target Practice",
        "type": "Advanced",
        "state": "up",
        "blurb": "Archer Arthur is practicing with his bow and arrows...",
        "description": "Archer Arthur is practicing with his bow and arrows. He decides to challenge himself by shooting at N trees at various distances away. Skilled as he is, Arthur does not miss any shots, but he requires more time to aim and adjust his bow for farther trees than closer ones. Specifically, a tree that is D units away takes Arthur D seconds to aim and shoot at. Arthur also needs to take R additional seconds to reload after every shot (at the beginning, his bow is loaded with an arrow but not properly aimed). To make the challenge more interesting, Arthur assigns point values P_i to each of the trees. If Arthur gives himself S total seconds for the challenge, what is the maximum number of points he can attain?<br><br>1 <= N <= 1,000 <br>1 <= S <= 10,000 <br>0 <= R <= 1,000 <br>1 <= D_i <= 25 <br>1 <= P_i <= 1,000,000",
        "inputForm": "Line 1: Three space-separated integers N, S, and R: the total number of trees, the total time, and the reload time <br>Lines 2...N+1: Line i+1 contains two space-separated integers D_i and P_i, the distance and point value of tree i",
        "sampleInput": "4 10 2<br>1 9<br>7 2<br>3 4<br>5 6",
        "outputForm": "Line 1: The maximum number of points Arthur can attain",
        "sampleOutput": "15"
    },
    "HPI5": {
        "title": "Delivering Messages",
        "type": "Advanced",
        "state": "up",
        "blurb": "Courier Carrie is delivering messages from the capital to the surrounding castles...",
        "description": "Courier Carrie is delivering messages from the capital to the surrounding castles. The N castles in the kingdom (including the capital castle and conveniently numbered 1 to N) are connected by roads such that there exists exactly one path from any castle to any other castle. Carrie can only traverse these roads. Each castle, including the capital, has M_i messages to be delivered to it. Carrie is very picky about the way she delivers her messages. She will only travel to a castle if it still has at least one message to be delivered, and once there, she will deliver exactly one message. Carrie starts her journey at the capital castle, denoted by C, and must end her journey at the capital as well, delivering a message when she arrives. Given these conditions, what is the maximum number of messages Carrie can deliver?<br><br>1 <= N <= 10,000 <br>1 <= M_i <= 10,000 <br>1 <= C <= N",
        "inputForm": "Line 1: N, the number of castles <br>Line 2: M_i of each castle, separated by spaces <br>Lines 3...N+1: Each line contains two space-separated integers denoting a road between those two castles <br>Line N+2: C, the number of the capital castle",
        "sampleInput": "4<br>1 2 2 5<br>4 1<br>2 1<br>3 2<br>2",
        "outputForm": "Line 1: The maximum number of messages Carrie can deliver",
        "sampleOutput": "4"
    },
    "HPI4": {
        "title": "Undamped Oscillations",
        "type": "Advanced",
        "state": "up",
        "blurb": "Bob the Knight is back, and he's stuck on the center of a one-dimensional plane.",
        "description": "Bob the Knight is back, and he's stuck on the center of a one-dimensional plane. The plane can be modeled as a number line (with Bob initially at 0), and he sees an escape route located at coordinate M. Bob may either move to the left or right, but must move K steps on the K'th move. Please help bob determine the minimum number of steps required to reach M.",
        "inputForm": "Line 1: M, the coordinate location of the escape route",
        "sampleInput": "SAMPLE INPUT #1<br>20<br><br>SAMPLE INPUT #2<br>11",
        "outputForm": "Line 1: The minimum number of steps required to reach M, or \"NONE\" if this is not possible.",
        "sampleOutput": "SAMPLE OUTPUT #1<br>7<br><br>SAMPLE OUTPUT #1<br>5"
    },
    "HPI3": {
        "title": "Data Compression",
        "type": "Advanced",
        "state": "up",
        "blurb": "King Frederick is having a hard time encoding his numerous kingdom manuscripts...",
        "description": "King Frederick is having a hard time encoding his numerous kingdom manuscripts, and needs your help to compress his documents to a more manageable size. Frederick has (ahead of his time!) developed a system whereby a string of text \"aaaabbbccddef\" is converted to a smaller from such as \"a4b3c2d2e1f1\". Note that each consecutive string of letters within the text is shortened to a form of the first letter (\"a\" for example) and a number representing how long the consecutive string is.",
        "inputForm": "The original string.",
        "sampleInput": "INPUT #1<br>abcaaaaaaaaadseeeeeeeq<br><br>INPUT #2<br>aaaaaaaaa",
        "outputForm": "The compressed version of this string.",
        "sampleOutput": "OUTPUT #1<br>a1b1c1a9d1s1e7q<br><br>OUTPUT #2<br>a9"
    },
    "HPI2": {
        "title": "How Large is My Kingdom?",
        "type": "Advanced",
        "state": "up",
        "blurb": "King Ferdinand is comparing the size of his ...",
        "description": "King Ferdinand is comparing the size of his kingdom to neighboring lords, and wants an accurate estimate of how large his kingdom actually is. Please help King Ferdinand determine the area of his land knowing the current floor plan of the kingdom. <br>The layout of Ferdinand's kingdom is delineated by two types of characters. Castle boundaries are delineated by 'X' and all other type of area is demarcated by a '.'. The area of the kingdom is defined as the integer value of the number of lattice points within the kingdom; that is, the number of dots within the region completely bounded by X's.",
        "inputForm": "Line 1: M and N, the boundaries of the castle layout <br>Lines 2...M+1: A line of N characters describing a row of the castle layout",
        "sampleInput": "9 19<br>...................<br>......XXX.XXX......<br>......X.X.X.X......<br>..XXX.X.X.X.X.XXX..<br>..X.XXX.XXX.XXX.X..<br>..X.............X..<br>..X.............X..<br>..XXXXXXXXXXXXXXX..<br>...................",
        "outputForm": "Line 1: Print the size of Ferdinand's kingdom.",
        "sampleOutput": "34"
    },
    "HPI": {
        "title": "Medieval Mathematics",
        "type": "Advanced",
        "state": "up",
        "blurb": "With his new currency system, King Richard is...",
        "description": "With his new currency system, King Richard is now struggling to add, subtract, multiply, and divide amounts of money in his kingdom. Please write a program to help Richard with his mathematics. <br>Richard begins with a certain amount of money M. Possible operations include<br>ADD K add K to the current amount of money<br>SUB K subtract K from the current amount of money<br>MUL K multiply the current amount of money by K<br>DIV K divide the current amount of money by K<br>COB K change the base of the amount of money from base K to base 10.<br><br><br>0 < N < 100 <br>0 < M < 1,000,000<br>For \"COB\": 2 < K < 10 {K an integer}<br>Assume that all operations are legal (e.g. no division by zero) and that each operation will result in a new whole number. Further assume that changing base will only be used once and, if used, will be the last operation in the set. <br>You will be OK if you store the net amount of money in a 32-bit integer.",
        "inputForm": "Line 1: N, the number of operations that Richard wants to perform <br>Line 2: M, the initial amount of money that Richard has<br>Lines 2..N+2: each individual operation of the form described in the problem statement",
        "sampleInput": "5<br>0<br>ADD 2<br>ADD 3<br>DIV 5<br>MUL 20<br>COB 4",
        "outputForm": "Line 1: Print the new amount of money Richard has after the operations have successfully been performed.",
        "sampleOutput": "8"
    },
    "PRA11": {
        "title": "Super Arithmetic Succession!",
        "type": "Advanced",
        "state": "up",
        "blurb": "The members of HHS Programming Club were at a Brawl tournament...",
        "description": "The members of HHS Programming Club were at a Brawl tournament and decided the tournament was not only a great opportunity to educate themselves on how to lose at Super Smash Brothers to Siraj, but also an opportunity to educate their minds by solving one on his great challenge problems. The problem is as follows: <br><br>Given an arithmetic progression of N numbers where the terms are A1, A2, A3, till AN. Determine how many to choose three numbers such that they are three consecutive terms of an arithmetic progression. (3,4,5) and (24,22,20) are examples of terms in an arithmetic progression while (2,7,11) and (3,7,5) are not.",
        "inputForm": "First line of the input is the integer N. Then the following line contains N integers A1, A2, …, AN separated by spaces.",
        "sampleInput": "10<br>3 5 3 6 3 4 10 4 5 2",
        "outputForm": "Output the number of ways to choose a triplet such that they are three consecutive terms of an arithmetic progression.",
        "sampleOutput": "9<br><br>EXPLANATION: (1, 3, 5), (1, 6, 9), (1, 8, 9), (3, 6, 9), (3, 8, 9), (4, 6, 10),(4, 8, 10),(5, 6, 9), (5, 8, 9)"
    },
    "PRB10": {
        "title": "Heal the World!",
        "type": "Beginner",
        "state": "up",
        "blurb": "As Michael Jackson was composing his song \"Heal the World\"...",
        "description": "As Michael Jackson was composing his song \"Heal the World\", he decided it would be cool to actually heal the world. The problem he decided to focus on was people inability to read numbers without simply stating digits. Michael is looking for a program that converts numbers (doubles or integers) to English. This program should support negative and positive numbers.",
        "inputForm": "A rational double or integer.",
        "sampleInput": "SAMPLE INPUT #1<br>12.32<br><br>SAMPLE INPUT #2<br>10,056",
        "outputForm": "The English version of the rational number.",
        "sampleOutput": "SAMPLE OUTPUT #1<br>twelve point three two<br><br>SAMPLE OUTPUT #2<br>ten thousand fifty six"
    },
    "PRA10": {
        "title": "Star Wars",
        "type": "Advanced",
        "state": "up",
        "blurb": "Star Wars characters were recently arguing...",
        "description": "Luke Skywalker was recently arguing with his father Darth Vader about who is better at math. However, Darth Vader had a distinct advantage due to his age and general experience so Luke decided to craft a computer program to aid him. The problem they are trying to solve is as follows: Given an integer N,  integers A and B are chosen randomly in the range [1..N]. Calculate the probability that the Greatest Common Divisor(GCD) of A and B equals to B.",
        "inputForm": "The integer N.",
        "sampleInput": "SAMPLE INPUT #1:<br>1<br><br>SAMPLE INPUT #2:<br>2",
        "outputForm": "A single line containing probability as an irreducible fraction.",
        "sampleOutput": "SAMPLE OUTPUT #1:<br>1\/1<br><br>SAMPLE OUTPUT #2:<br>3\/4"
    },
    "PRB9": {
        "title": "Rapper Math Part 2!",
        "type": "Beginner",
        "state": "up",
        "blurb": "Jay-Z and G-Eazy were arguing...",
        "description": "Jay-Z and G-Eazy were recently arguing over whose one letter suffix\/prefix was better. Eventually, the argument reached a stalemate, and they both decided to end it through a test of intelligence. Jay- Z asked G-Eazy if given an array of integers he could find out if it were possible to choose a group of some of the integer, beginning at a pre-determined start index, such that the group sums to the given target? However, the additional constraint that all 6's must be chosen was added by Jay-Z since the \"G\" in G-Eazy looks kind of like a 6.",
        "inputForm": "The start index on one line, the array's elements on the next line separated by spaces, the end index on the last line. ",
        "sampleInput": "SAMPLE INPUT #1<br>0<br>5 6 2<br>8<br><br>SAMPLE INPUT #2<br>0<br>5 6 2 <br>9",
        "outputForm": "Whether or not the group sums to the given target.",
        "sampleOutput": "SAMPLE OUTPUT #1<br>true<br><br>SAMPLE OUTPUT #2<br>false"
    },
    "PRA9": {
        "title": "Shelby Goes Shopping!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Mr. Shelby was recently shopping at Whole Foods when he encountered an interesting promotion...",
        "description": "Mr. Shelby recently journeyed to Whole Foods in order to purchase eggplant, but when he was in line he saw a special promotion, namely a \"Buy two, get two for free\" offer. The two items he buys can be of varying price, but Whole Foods always charges for the 2 most costly items and gives other 2 as free. For example, if the items cost 9, 11, 22, 52, then you have to pay 74 and take all 4 items.<br><br>Mr. Shelby is busy reordering his items to reduce the total price he has to pay. He can separate the items and get them on different bills if needed. What is the least price Shelby has to pay to buy all the N items?",
        "inputForm": "First line of each test case has a single integer N, the number of items Mr. Shelby wants to buy. The second line of each test case has N space separated integers, which are the costs of items Mr. Shelby wants to buy.",
        "sampleInput": "SAMPLE INPUT #1<br>4<br>1 1 2 2<br><br>SAMPLE INPUT #2<br>2<br>10 200<br><br>SAMPLE INPUT #3<br>7<br>1 1 10 2 2 2 1",
        "outputForm": "The least price Mr. Shelby has to pay.",
        "sampleOutput": "SAMPLE OUTPUT #1<br>4<br><br>SAMPLE OUTPUT #2<br>210<br><br>SAMPLE OUTPUT #3<br>14"
    },
    "PRA8": {
        "title": "Palindromes",
        "type": "Advanced",
        "state": "up",
        "blurb": "Palindromes are numbers that read the same forwards as backwards.",
        "description": "Palindromes are numbers that read the same forwards as backwards. The number 12321 is a typical palindrome.<br\/><br\/>Given a number base B (2 <= B <= 20 base 10), print all the integers N (1 <= N <= 300 base 10) such that the square of N is palindromic when expressed in base B; also print the value of that palindromic square. Use the letters ‘A’, ‘B’, and so on to represent the digits 10, 11, and so on.<br\/><br\/>Print both the number and its square in base B.",
        "inputForm": "A single line with B, the base (specified in base 10).",
        "sampleInput": "10",
        "outputForm": "Lines with two integers represented in base B. The first integer is the number whose square is palindromic; the second integer is the square itself.",
        "sampleOutput": "1 1<br\/>2 4<br\/>3 9<br\/>11 121<br\/>22 484<br\/>26 676<br\/>101 10201<br\/>111 12321<br\/>121 14641<br\/>202 40804<br\/>212 44944<br\/>264 69696"
    },
    "PRB8": {
        "title": "Lovely Math!",
        "type": "Beginner",
        "state": "up",
        "blurb": "California Tools wants to hire you for a job! Turns out that they want a LCM feature for their program.",
        "description": "California Tools wants to hire you for a job! Turns out that they want a LCM feature for their program. They figure that since you are good with programming, you can easily code the LCM feature. Seems like they will not give you your paycheck until you have done this task as well. Of course, that is hardly a problem for an ambitious worker like you. <br\/><br\/> The LCM of two numbers is the lowest number that can be divided by both numbers, without a remainder. The LCM of 12 and 9, for example, is 36. It is possible for the LCM to be one of the two numbers.",
        "inputForm": "Line 1: Two space-separated integers, lower number first",
        "sampleInput": "16 24",
        "outputForm": "Line 1: The LCM of the integers",
        "sampleOutput": "48"
    },
    "PRB7": {
        "title": "Kangaroo Joey!",
        "type": "Beginner",
        "state": "up",
        "blurb": "Kangaroo Joey is having coding problems...",
        "description": "Kangaroo Joey is having trouble with a coding problem assigned to him by Senpai Koala and requires your help. The problem is as follows: <br><br>Say that a \"clump\" in an array is a series of 2 or more adjacent elements of the same value. Return the number of clumps in the given array. ",
        "inputForm": "The elements of the array on a single line separated by commas.",
        "sampleInput": "1, 2, 2, 3, 4, 4",
        "outputForm": "The number of clumps in the given array.",
        "sampleOutput": "2"
    },
    "PRA7": {
        "title": "The Meeting!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Programming club members are lost in the wilderness of HHS...",
        "description": "The programming club members, lost in the jungle of HHS, are desperately searching for a way to the programming club meeting (probably in A211). They start at (0,0) and must reach (n,n) the meeting location. The grid has size n X n. List the total number of possible paths which the programmers can take to reach the meeting (grid given in input).",
        "inputForm": "The dimensions of the grid are given first. From there, the grid is given in 0's and 1's. A 0 indicates that square is can be traversed by the programmers while a 1 indicates the square is blocked off.",
        "sampleInput": "3<br>0 0 0<br>0 1 0<br>0 0 0",
        "outputForm": "The number of total possible paths which the programmers can take to reach the meeting (without revisiting squares in a single path). In other words, the number of paths from (0,0) to (n,n).",
        "sampleOutput": "2"
    },
    "PRB6": {
        "title": "Mirror Array!",
        "type": "Beginner",
        "state": "up",
        "blurb": "We'll say that a \"mirror\" section...",
        "description": "We'll say that a \"mirror\" section in an array is a group of continuous elements such that somewhere in the array, the same group appears in reverse order. For example, the largest mirror section in {1, 2, 3, 8, 9, 3, 2, 1} is length 3 (the {1, 2, 3} part). Return the size of the largest mirror section found in the given array. ",
        "inputForm": "The length and element of the array are given, each separated by a carriage return.",
        "sampleInput": "8<br>1<br>2<br>3<br>8<br>9<br>3<br>2<br>1",
        "outputForm": "The size of the largest mirror section found in the given array. ",
        "sampleOutput": "3"
    },
    "PRA6": {
        "title": "Pokemon Showdown!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Ash and Brock decided finally decided to settle their differences through a game of wits...",
        "description": "Ash and Brock are playing a game with their Pokémon. Each time a player is allowed to pick 1, 2 or 4 Pokeballs from a bag filled with all their Pokeballs, and the player that gets the last Pokeball is the winner. Assume that both players are extremely intelligent(of course this is overstating things a bit for Ash) and he will try his best to work out a winning strategy. For example, if there are 2 Pokeballs and Ash is the first player to pick, he will certainly pick 2 Pokeballs and win. If there are 3 Pokeballs and Ash is still the first player to pick, no matter if he picks 1 or 2 Pokeballs, Brock will get the last Pokeball and win the game. Given the number of Pokeballs and the order the players will choose in you are required to determine the victor, and calculate how many different strategies there are for  him to win the game. You can assume that there are no more than 30 Pokeballs.",
        "inputForm": "You are given the order the players will move in and the number of Pokeballs in the bag. Ash and Brock's names will be spelled the way they are in the sample input.",
        "sampleInput": "3 ash brock<br>",
        "outputForm": "The name of the winner followed by a space and the number of ways they could win.",
        "sampleOutput": "brock 2"
    },
    "PRB5": {
        "title": "Letter Counter!",
        "type": "Beginner",
        "state": "up",
        "blurb": "Dr. Seuss was recently completing a children's book...",
        "description": "Dr. Seuss was completing his amazing novel one fish, two fish, red fish, blue fish when he realized he may not have been using the letters of the alphabet correctly. He needed a way to count the number of each specific letter in a given string of characters. ",
        "inputForm": "A string of characters.",
        "sampleInput": "hello",
        "outputForm": "The number of each specific letter in a given string of characters. Each letter should be printed on its own line in alphabetical order. The letter should be the first thing on the line, followed by a space, and finally the number of occurrences of each letter.",
        "sampleOutput": "e 1<br>h 1<br>l 2<br>o 1"
    },
    "PRA5": {
        "title": "Tom and Jerry!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Tom's mom is in town to help him with some very important business...",
        "description": "Jerry and Tom's never ending struggle has reached its climax with the arrival of Tom's mom, a legendary mouse catcher known by all. The three of them are locked in the location housing the final battle, an N by M size rectangular pit of doom. Their chase is occurring in the rectangular pit of doom occurs in a somewhat civilized turn by turn manner. Specifically, Jerry moves, then both cats move. In each move Jerry, Tom, and his mom can move only one square vertically or horizontally. If Jerry is located at the edge of the pit then in his next move he can jump off the field and is saved from Tom and his mom. If in the next move one of the cats moves to the pit location with Jerry then there is no escape for Jerry.<br><br>Given Jerry, Tom, and his mom's respective initial positions determine if there is a way for Jerry to escape the cats. Jerry is the first to make his move.",
        "inputForm": "In the first line of input two integers N and M are given, not exceeding 100, where N is the number of rows while M is the number of columns. The second line contains a number k [k <= 10], which defines the number of test cases for the given rectangular pit of doom. In the next k lines the initial positions of Jerry and the cats are given. The position in the field is given by two numbers: the first is the number of the row, the second is the number of the column. The first two integers are the coordinates of Jerry, the next four integers are the coordinates of the cats. The rows and columns begin counting at 1.",
        "sampleInput": "5 3<br>1<br>2 2 1 1 3 3<br>",
        "outputForm": "You must output k lines with answers for each test case. Print out 1 if Jerry can escape or 0 otherwise, skipping lines between each 0 or 1.",
        "sampleOutput": "0"
    },
    "PRB4": {
        "title": "Picky Penguins!",
        "type": "Beginner",
        "state": "up",
        "blurb": "Precious penguins in Madagascar are being assaulted... ",
        "description": "A group consisting of a vicious lion, zebra, hippo, and giraffe assaulted an innocent cuddly group of penguins. The penguins endured a terrible beating and the number of their bruises was too great to be counted by with their simple technology. Skikowal, the penguin's head of tech, resorted to his best friend for help. Macintosh suggested using code to count the number of bruises and for fun find the factorial of the total number of bruises. ",
        "inputForm": "A list of 4 positive integers representing the number of bruises received by each penguin. ",
        "sampleInput": "4<br>5<br>2<br>3",
        "outputForm": "The factorial of the sum of all the bruises  is printed out.",
        "sampleOutput": "87178291200"
    },
    "PRA4": {
        "title": "Batman and Mr. Freeze!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Gotham's knight in shining army has done something naughty...",
        "description": "Batman was recently betrayed by his ally Mr. Freeze after stealing his lychee gelato (don't do this kids!). In his rage, Mr. Freeze froze Batman's head solid with his freeze gun. Eventually, Batman thawed but he had lost a few of his basic skills, including the ability to order things lexicographically. Batman knew his only option was to get his much smarter butler, Alfred, to write some code to do it for him. Alfred needs to write code which takes in a number N and prints out all N! permutations of the letter \"a\" through the Nth letter in the alphabet in lexicographic order (lowercase).",
        "inputForm": "A single positive integer representing N, the numerical position of a letter in the alphabet (a is 1). All N! permutations of the letter a through the above letter must be computed. These permutations must use all letters \"a\" through the Nth letter.",
        "sampleInput": "3",
        "outputForm": "All N! permutations of the letter a through the Nth letter in the alphabet must be printed out in lexicographic order (lowercase).",
        "sampleOutput": "abc<br>acb<br>bac<br>bca<br>cab<br>cba<br>"
    },
    "PRA3": {
        "title": "Harry Plotter!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Harry Potter is trying to organize Professor Snape's potions cabinet...",
        "description": "The devious Professor Snape has coerced young, innocent Harry Potter into organizing his potions cabinet. Snape organizes all his potions on his shelves in arrays with length P. These potions were meant to be organized by time meant to paralyze its drinker, however mischievous students ruined his collection. In order to begin organizing the potions, Harry decided to locate the index of the element in the array of potions from which the sum of elements to the left of the element equal the sum of elements to the right of the element.",
        "inputForm": "An list of integers with length N representing Snape's array of potions. The first element of the array is the first number in the list.",
        "sampleInput": "7<br>1<br>2<br>5<br>4<br>3<br>4<br>1",
        "outputForm": "The index (indices of an array start at 0) of the element at which the sum of elements in the array from the left of the element equals the sum of elements in the array from the right.",
        "sampleOutput": "3"
    },
    "PRB3": {
        "title": "The Final Assignment!",
        "type": "Beginner",
        "state": "up",
        "blurb": "Before deciding to cruelly fire you, In-N-Out has one last assignment...",
        "description": "In-N-Out has one final assignment for you before firing you and paying you a much lower salary than you deserve. The company's higher-ups need to know  what the highest number of calories one of their burger contains is. They have decided to give you a list of numbers containing the numbers of calories in an assortment of their burgers, and expect you to determine the number of calories in their largest burger.",
        "inputForm": "A list of numbers with size N from which you have to print out the largest number. N is the first number of the input.",
        "sampleInput": "5<br>102<br>3356<br>446<br>242<br>124",
        "outputForm": "A number representing the largest integer in the list of inputted numbers.",
        "sampleOutput": "3356"
    },
    "PRA2": {
        "title": "Rapper Math!",
        "type": "Advanced",
        "state": "up",
        "blurb": "Jay-Z was recently composing new masterpieces...",
        "description": "Jay-Z was recently composing songs for the radio, however the radio beeps out explicit content thus destroying the rhythm of his songs. Jay-Z needs to find a way to change the profane words in his songs to similar words. However, he does not want to do much work and would like to change the explicit content to other words using the minimum amount of insertions, deletions, and substitutions.",
        "inputForm": "The input will be two strings. The first string will be the one that needs to be transformed into the second string using the minimum amount of insertions , deletions, and substitutions.",
        "sampleInput": "Programming<br>Coding",
        "outputForm": "The output is a single integer representing the minimum amount of insertions, deletions, and substitutions required to transform the first input into the second input.",
        "sampleOutput": "7"
    },
    "PRB2": {
        "title": "Average-it-Out!",
        "type": "Beginner",
        "state": "up",
        "blurb": "In-N-Out's employees have been struggling with math lately...",
        "description": "In-N-Out burger has been plagued by cheap employees, who for some odd reason refuse to put a sizable amount of French fries in each order. To remedy this, the In-N-Out higher-ups decided to put their employees through math practice. However, the employees refused to be coerced to do basic math problems, and developed a programming solution for the problem. They were supposed to determine the average of all positive numbers between two limits.",
        "inputForm": "Two integer representing the limits between which the average of all the POSITIVE integers should be found. The first integer is the smaller limit of the two.",
        "sampleInput": "-5<br>5",
        "outputForm": "An double representing the average of all the POSITIVE numbers between those numbers (non-inclusive).",
        "sampleOutput": "2.5"
    },
    "PRA1": {
        "title": "The Prime Job!",
        "type": "Advanced",
        "state": "up",
        "blurb": "You are in your interview for your dream job when things go terribly wrong...",
        "description": "You are sitting in room A211 in Homestead High School across from the legendary Mr. Shelby who is interviewing you to determine whether or not you are qualified to teach the art of programming to middle school students at CMS and SMS. Everything was going well until Mr. Shelby threw you a curve ball; he asked you the very same question that prevented the other candidates from being deemed fit to take the job! Mr. Shelby wanted to know how to calculate all prime numbers till a specific number, and then multiply those numbers together to obtain a single integer. However, Mr. Shelby sensed you were a special candidate and wanted to challenge you further. He then instructed you to convert the single integer you obtained by multiplying all the prime numbers, originally in base 10, to base 8.",
        "inputForm": "A single integer representing the limit to which all prime numbers must be calculated, not inclusive. (e.g. a limit of 20 means all prime numbers up to 20)",
        "sampleInput": "20",
        "outputForm": "A single integer representing the product of all prime numbers to the aforementioned limit, in base 8.",
        "sampleOutput": "45000552"
    },
    "PRB1": {
        "title": "In-n-Out",
        "type": "Beginner",
        "state": "up",
        "blurb": "Solve this challenge in order to win a lifetime supply of In-n-Out burgers...",
        "description": "Lately, In-n-Out has been struggling to correctly take orders from its customer! You have been hired to fix their input\/output system. Solving this problem will provide you with the basis to solve future challenge problems as they require you to take in values, perform actions on these values based on the problem, and finally output your calculations. <br><br>Practice by multiplying each input by 3 to calculate the correct number of burgers ordered by each customer.",
        "inputForm": "A single line containing an integer. We recommend you use a java.util.Scanner to receive the input.",
        "sampleInput": "224",
        "outputForm": "A single line containing an integer representing the input multiplied by three. We recommend using System.out.println(\"\") to output your answer.",
        "sampleOutput": "672"
    }
}